In [9]:
import pandas as pd

data=pd.DataFrame({
    'age':[25,30,35,40,45],
    'salary':[5000,6000,7000,8000,9000],
    'country_code':[1,1,1,1,1]
})
data

   age  salary  country_code
0   25    5000             1
1   30    6000             1
2   35    7000             1
3   40    8000             1
4   45    9000             1

In [ ]:
from sklearn.feature_selection import VarianceThreshold
vt=VarianceThreshold(threshold=0.1)
selected_data=vt.fit_transform(data)

selected_features=data.columns[vt.get_support()]
print("Selected Features:",selected_features)

Selected Features: Index(['age', 'salary'], dtype='object')